Revit 2024 API
ExporterIFC.SetFile Method
 Sets the handle to the IFC file being created during this export operation.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public void SetFile(
	IFCFile file
)
Visual Basic
Public Sub SetFile ( _
	file As IFCFile _
)
Visual C++
public:
void SetFile(
	IFCFile^ file
)
Parameters
file
Type: Autodesk.Revit.DB.IFC.IFCFile
 The handle to the file.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
ExporterIFC Class
Autodesk.Revit.DB.IFC Namespace